results/spike_test
        /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: spike_test.js
        output: InfluxDBv1 (http://localhost:8086)

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 4m30s max duration (incl. graceful stop):
              * default: Up to 1000 looping VUs for 4m0s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)



  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95) < 1000' p(95)=466.32ms

    http_req_failed
    ✓ 'rate < 0.01' rate=0.00%


  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=229.02ms min=17.51ms med=265.81ms max=2.74s p(90)=421.71ms p(95)=466.32ms
      { expected_response:true }...: avg=229.02ms min=17.51ms med=265.81ms max=2.74s p(90)=421.71ms p(95)=466.32ms
    http_req_failed................: 0.00%  0 out of 98892
    http_reqs......................: 98892  409.824751/s

    EXECUTION
    iteration_duration.............: avg=1.47s    min=1.26s   med=1.43s    max=4.2s  p(90)=1.63s    p(95)=1.72s   
    iterations.....................: 49446  204.912376/s
    vus............................: 1      min=1          max=1000
    vus_max........................: 1000   min=1000       max=1000

    NETWORK
    data_received..................: 185 MB 765 kB/s
    data_sent......................: 8.2 MB 34 kB/s